//*2014最新属相数据 
//*唐有炜 整理
//*时间：2014年10月29日

var shengxiao_data_2014 = [
    {
        name: "鼠",
        code: "0",
        desc: "<p>非常重视感情，无论是和孩子、大人还是和老人相处，都极尽用心。</p><p>精力充沛、做事一丝不苟，他们似乎总也不觉得累，买菜、做饭、打扫卫生、辅导小孩，统统不是问题，而且干的热火朝天。</p><p>幽默、善于社交，善于调节气氛，在家庭中阿姨会使家庭成员和谐相处。</p><p>属鼠的阿姨爱干净，会将家务整理得有条不紊，能大大地减轻家庭主妇的家务负担。</p>"
    },
    {
        name: "牛",
        code: "1",
        desc: "<p>体格强壮如牛，有耐力，做家务不费劲，轻松搞定。</p><p>为人温厚老实，值得信赖。客户大可以把很多事交给她来做，如接送孩子上下学、看护宝宝、照顾老人、给钱买米买菜。您可以放心地去工作或者旅游，因为老实可靠的牛阿姨会帮您解除后顾之忧。</p><p>做事小心谨慎、脚踏实地，像牛一样勤勤恳恳、毫无怨言。</p><p>重视工作与家庭。家政行业集工作与家庭于一体，最适合属牛的阿姨来干了。</p>"
    }, {
        name: "虎",
        code: "2",
        desc: "<p>性格刚毅顽强，喜欢接受挑战，不挑活。不论是照顾老人、病人，还是饲养宠物，只要自己能做的，都不挑剔，而且个性很要强，要么不做，要做就做到最好是属虎的阿姨心底最真实的写照。</p><p>胆大自信，有魄力。生活中如果遇到棘手的事，属虎的阿姨能快刀斩乱麻，所以在别人看来，虎阿姨很潇洒，大有女侠的风范。</p><p>重视承诺、为人坦诚、易赢得信任。阿姨有这样优异的品质，客户能放心地把家交给阿姨们操持，自己安心地在外打拼。</p>"
    },
    {
        name: "兔",
        code: "3",
        desc: "<p>个性温柔体贴，为人和气，给客户很舒服的感觉。</p><p>心思细密，头脑冷静，遇事不慌，应变力强。</p><p>擅长沟通，很受客户的欢迎。如果遇到和客户不一致的观点，如带孩子的观念、方式不同，做饭做家务的方式不同，兔阿姨会组织大家耐心沟通，达成一致的共识，然后大家按此方案做事，会减少很多摩擦和无谓的争执。</p><p>厌恶与人争执，带有能化敌为友的柔和气质，在客户家就算发生争执不快，也会很快化解的。</p>"
    },
    {
        name: "龙",
        code: "4",
        desc: "<p>体魄强壮、精力充沛，做活有劲，不嫌苦不嫌累</p><p>性子急，做事麻利，不拖拉。龙阿姨奉行今日事今日毕。</p><p>热情慷慨，善解人意，能想客户之所想，急客户之所急。做事之前一定会先为客户考虑，而把自己的需求暂时压抑。</p><p>不喜欢搬弄客户家的是非，为人坦诚，值得信赖，雇用这样的阿姨，客户尽可以放心。</p>"
    },
    {
        name: "蛇",
        code: "5",
        desc: "<p>多做少说，懂得倾听客户的需求。客户和阿姨沟通相处的时候不会觉得累，相反会觉得很轻松，大家在一起相处也较融洽。</p><p>脾气好，如果被客户批评，轻易不生气。</p><p>心地善良，把帮助别人当成是一件乐事。</p><p>洞察力强，应变能力强。做事善始善终，属蛇的阿姨稳定性极强。</p>"
    },
    {
        name: "马",
        code: "6",
        desc: "<p>性格爽朗热情，与人相处融洽。</p><p>能很快和客户熟悉，尽快了解工作内容，上手快，适应性强，深得客户的肯定与赏识。</p><p>做事积极努力，轻易不认输，内心充满了力量。</p><p>俗话说人靠衣裳马靠鞍，属马的阿姨也很讲究衣着，在意自己的形象，客户看着顺眼，心情舒畅。</p>"
    },
    {
        name: "羊",
        code: "7",
        desc: "<p>性格内向，看似很柔弱，但其实有一颗强大的内心，对于很多大事都能独自承受。</p><p>考虑周到，做事慎重，事情交给羊阿姨办，您尽管放心。</p><p>懂得节俭。不出一个月您就会发现，家里的水费电费煤气费都降低了，更为重要的是，您家的生活品质还和以前一样，甚至会有进一步的提升。</p><p>心怀感恩，懂得孝顺。感谢雇主给我们工作这句话常挂在阿姨嘴边。</p>"
    },
    {
        name: "猴",
        code: "8",
        desc: "<p>手脚灵活、善于模仿，学习新事物能力强。对育儿知识一无所知的阿姨去上培训课，老师教给大家如何给婴儿做抚触、洗澡，如何给宝宝添加辅食，猴阿姨记性好，动手能力强，一学就会，别的阿姨纷纷投来羡慕的目光。请这样的阿姨回家，客户算赚着了。</p><p>机智活泼、热情奔放，性格宽厚，人缘好，常给人以被关注的感觉。猴阿姨走到哪里，哪里就是一片热闹的场景，若是到了客户家，也会给大家带来欢乐。</p>"
    },
    {
        name: "鸡",
        code: "9",
        desc: "<p>为人温和，让他人易接受。阿姨们说话做事给人的感觉是清风细雨，也很贴心。</p><p>谦虚谨慎，不张扬。善于观察，做活细心。洗碗、洗衣服、擦地板、看孩子，每一个环节阿姨都会做的很完美，客户也很难挑出有什么毛病。</p><p>表现力强，善于把握机会。不论是面试，还是日常工作，属鸡的阿姨都能表现地很好，同时给别人留下深刻印象。</p>"
    },
    {
        name: "狗",
        code: "10",
        desc: "<p>为人正直，守规矩。不该做的事不做，不该问的话不问，选择这样的阿姨，不会增加客户的烦恼。</p><p>对上司、长辈敬重。面对比自己见识广、文化高的客户，这份敬重感也同样适用。</p><p>工作认真，有责任感，对雇主交代的事，总是超乎意料的完成。</p><p>防卫意识强，做事考虑全面，轻易不出差漏。相信客户都会需要一位做事效率高的好阿姨吧。</p>"
    },
    {
        name: "猪",
        code: "11",
        desc: "<p>待人真诚、胸襟开阔，不会对家庭中的琐事斤斤计较，雇主若碰到这样的好阿姨，会相处得很愉快。</p><p>对自己要求严格，做事认真，把每件事都当作学问来做。</p><p>有强烈的经济观念，雇主可以放心地将财务交给猪阿姨保管。她们每天会记着流水账，相信您若问哪天花了哪一笔钱，她们会记得一清二楚。</p>"
    }
];

//根据名称获取属相
function get_desc_by_sx(sx) {
    var result = "";
    for (var i = 0; i < shengxiao_data_2014.length; i++) {
        //console.log(shengxiao_data_2014[i]);
        var sxObj = shengxiao_data_2014[i];
        if (sxObj.name == sx) {
            result = sxObj.desc;
            break;
        } else {
            result = "暂无";
        }

    }
    return result;
}





