//*2014最新星座数据 
//*唐有炜 整理
//*时间：2014年10月29日

var xingzuo_data_2014 = [
    {
        name: "摩羯",
        code: "0",
        desc: "<p>体格健壮、活力充沛。 无论是洗衣做饭，还是带小孩、照顾老人，摩羯座的阿姨都能把分内的事处理好。</p><p>严谨刻板、稳重老成。这样优良的品质总能让客户对摩羯座的阿姨放心，对阿姨办的事儿放心。</p><p>忍耐力较强、做事有责任感，能胜任客户交代的任务。</p><p>有时间观念，做事不拖拉。重视权威和名声。如果能得到客户的尊重和认可，摩羯座的阿姨会更有动力。</p>"
    },
    {
        name: "水瓶",
        code: "1",
        desc: "<p>崇尚自由与博爱。水瓶座的阿姨不会在背后和姐妹一起谈论客户的是非和隐私，她们深知作为家政员，要少说多做守规矩。</p><p>热爱生命、乐于助人、心胸开阔。阿姨们会把小生命的诞生当成是很神圣的事，所以对小宝宝非常温柔体贴。</p><p>遇事客观冷静、善于思考。机智聪明，对于客户提出的要求，一点即透</p><p>做事讲科学，找方法。水瓶座的阿姨知道哪种食物含钙高，胡萝卜怎么吃有营养，小孩不爱吃饭该怎么办。</p>"
    },
    {
        name: "双鱼",
        code: "2",
        desc: "<p>性格温柔和善、仁慈宽厚。阿姨不会因为一些小事斤斤计较、揪住不放，相反，她们一般不会把不快放在心上，心态很好，绝不会带着情绪工作。</p><p>工作勤恳、乐于奉献。阿姨的踏实勤奋很受客户的认可，通常能在一户人家干一两年，稳定性极强。</p><p>善于观察、认真仔细。双鱼座的阿姨眼里有活，地板脏了、宝宝把玩具弄乱一地、饭菜蹭的到处都是、家里缺这少那，阿姨都能及时发现并解决问题。</p>"
    },
    {
        name: "白羊",
        code: "3",
        desc: "<p>精力旺盛，做活不觉得累。买菜烧饭、洗衣服、擦地板、外出采购，照顾小孩，这些通通不是问题，阿姨干的是非常起劲、兴致勃勃。</p><p>好奇心强、求知欲望重，愿意提升自己的职业技能，这样的阿姨是绝对的优质阿姨。</p><p>意志力顽强、抗挫能力强。</p><p>凡事喜欢主动争取，不会被动等待。白羊座的阿姨不会等待别人来主宰她们的命运。</p>"
    },
    {
        name: "金牛",
        code: "4",
        desc: "<p>慢条斯理，做事前考虑很全面。比如客户家要宴请一位朋友来家吃饭，金牛座的阿姨会一点点做准备，从客人的喜好与忌口、菜点的选择到甜点饮料的准备，事无巨细。请金牛座的阿姨做帮手，会使客户轻松不少。</p><p>待人真心、为人率真，和金牛座的阿姨交往很轻松，不会产生压抑或者不信任感。</p><p>做事负责，讲究规则及合理性，能大大提高做家务的效率。</p><p>工作勤勉、稳定性极强，轻易不下户。</p>"
    },
    {
        name: "双子",
        code: "5",
        desc: "<p>活力充沛，做活不费力。双子座阿姨浑身充满了力量。</p><p>口才一流，如果客户家有小孩，让阿姨教宝宝如何与人沟通，更能发挥双座阿姨的长处。</p><p>机智敏锐、变化速度快。干活勤快、有眼力见的阿姨通常很受欢迎，她们能很快揣摩出客户的需求。</p>"
    },
    {
        name: "巨蟹",
        code: "6",
        desc: "<p>精力旺盛，干活有劲。待人和善体贴、乐于助人。</p><p>服从性强、对人忠诚，工作中以客户为主，不会借各种理由下户。</p><p>记忆力好、求知欲强，有技能，受客户欢迎。客户请这样的阿姨回家，会觉得物有所值，甚至物超所值。</p><p>有职业道德感，做事认真负责，客户和家政公司都可以大大放心。在巨蟹座阿姨的眼里，他们认为拿着客户的工资，就要付出相应的努力。</p>"
    },
    {
        name: "狮子",
        code: "7",
        desc: "<p>性格外向、对人友善体贴。阿姨们会把小生命的诞生当成是很神圣的事。</p><p>心胸开阔、光明磊落、不拘小节、讲义气。大家都愿意和宽容大方的人交朋友，这些正能量会给狮子座的阿姨带来好运气，也会带给客户带来益处。</p><p>做事坚持原则和理念，阿姨不混账，和她讲道理即可。</p>"
    },
    {
        name: "处女",
        code: "8",
        desc: "<p>做事认真而有条理、追求完美，请这样的阿姨在家帮忙做活，会让客户轻松不少。</p><p>做事善始善终，轻易不下户，稳定性极高，减少了客户总换阿姨的烦恼。</p><p>心态好，对不愉快的事能放得开，阿姨不会把负面情绪传染给他人，更不会带着情绪工作。</p>"
    },
    {
        name: "天秤",
        code: "9",
        desc: "<p>天性善良温和、性格外向、感情丰富</p><p>客观看待事物，常为他人着想，不胡搅蛮缠。</p><p>能保守秘密，不会和其他阿姨聚在一起谈论客户家的事情，相信这一点也为大部分客户所认可。</p>"
    },
    {
        name: "天蝎",
        code: "10",
        desc: "<p>精力充沛，干活不费力。擦地板、手洗衣服、清洗抽油烟机和冰箱，给宝宝做抚触、洗澡，这些都难不倒阿姨。</p><p>观察力较为敏锐、做事凭直觉。家里若有小孩或者病人，天蝎座的阿姨能及时发现孩子是不是感冒发烧了、是不是心情不好了、家里的病人是不是有病变了，并果断采取措施，避免事态恶化。这种负责任的态度还是很受客户肯定的。</p><p>意志力顽强、目标性强、责任感强，能接受客户的挑剔。</p>"
    },
    {
        name: "射手",
        code: "11",
        desc: "<p>性格外向乐观、热情健谈、幽默，易于交往。客户家若有射手座的阿姨，相当于多了一个开心果。</p><p>精力充沛、活动力强,，能胜任做家务带小孩的任务。</p><p>思想开放，愿意尝试新鲜事物。这样的天性使射手座的阿姨能尽快适应在客户家的生活，有利于开展工作。</p><p>有理想，有干劲，对失败不轻易妥协。这样的性格，使得阿姨们就像年轻人一样始终充满活力，精神焕发，客户看了对阿姨也比较放心。</p>"
    }
];

//根据名称获取星座
function get_desc_by_xz(xz) {
    var result = "";
    for (var i = 0; i < xingzuo_data_2014.length; i++) {
        //console.log(xingzuo_data_2014[i]);
        var xzObj = xingzuo_data_2014[i];
        if (xzObj.name == xz) {
            result = xzObj.desc;
            break;
        } else {
            result = "暂无";
        }

    }
    return result;
}